In [1]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

'Connected: None@chinook.db'

In [2]:
%%sql
SELECT
    name,
    type
FROM sqlite_master
WHERE type IN ("table","view");

Done.

[('album', 'table'),
 ('artist', 'table'),
 ('customer', 'table'),
 ('employee', 'table'),
 ('genre', 'table'),
 ('invoice', 'table'),
 ('invoice_line', 'table'),
 ('media_type', 'table'),
 ('playlist', 'table'),
 ('playlist_track', 'table'),
 ('track', 'table'),
 ('country_other', 'view')]

In [3]:
%%sql
SELECT
    *
FROM invoice
LIMIT 5;

Done.

[(1, 18, '2017-01-03 00:00:00', '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', 15.84),
 (2, 30, '2017-01-03 00:00:00', '230 Elgin Street', 'Ottawa', 'ON', 'Canada', 'K2P 1L7', 9.9),
 (3, 40, '2017-01-05 00:00:00', '8, Rue Hanovre', 'Paris', 'None', 'France', '75002', 1.98),
 (4, 18, '2017-01-06 00:00:00', '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', 7.92),
 (5, 27, '2017-01-07 00:00:00', '1033 N Park Ave', 'Tucson', 'AZ', 'USA', '85719', 16.83)]

The Chinook record store has just signed a deal with a new record label, and you've been tasked with selecting the first three albums that will be added to the store, from a list of four. All four albums are by artists that don't have any tracks in the store right now - we have the artist names, and the genre of music they produce:

Artist Name	Genre:

Regal,	Hip-Hop

Red Tone,	Punk

Meteor and the Girls,	Pop

Slim Jim Bites,	Blues

The record label specializes in artists from the USA, and they have given Chinook some money to advertise the new albums in the USA, so we're interested in finding out which genres sell the best in the USA.

You'll need to:
1. Write a query to find out which genres sell the most tracks in the USA, 
2. Write up a summary of your findings, and make a recommendation for the three artists whose albums we should purchase for the store.

In [4]:
%%sql

SELECT *
 FROM genre;

Done.

[(1, 'Rock'),
 (2, 'Jazz'),
 (3, 'Metal'),
 (4, 'Alternative & Punk'),
 (5, 'Rock And Roll'),
 (6, 'Blues'),
 (7, 'Latin'),
 (8, 'Reggae'),
 (9, 'Pop'),
 (10, 'Soundtrack'),
 (11, 'Bossa Nova'),
 (12, 'Easy Listening'),
 (13, 'Heavy Metal'),
 (14, 'R&B/Soul'),
 (15, 'Electronica/Dance'),
 (16, 'World'),
 (17, 'Hip Hop/Rap'),
 (18, 'Science Fiction'),
 (19, 'TV Shows'),
 (20, 'Sci Fi & Fantasy'),
 (21, 'Drama'),
 (22, 'Comedy'),
 (23, 'Alternative'),
 (24, 'Classical'),
 (25, 'Opera')]

In [5]:
%%sql
SELECT *
    FROM invoice_line
    LIMIT 10;

Done.

[(1, 1, 1158, 0.99, 1),
 (2, 1, 1159, 0.99, 1),
 (3, 1, 1160, 0.99, 1),
 (4, 1, 1161, 0.99, 1),
 (5, 1, 1162, 0.99, 1),
 (6, 1, 1163, 0.99, 1),
 (7, 1, 1164, 0.99, 1),
 (8, 1, 1165, 0.99, 1),
 (9, 1, 1166, 0.99, 1),
 (10, 1, 1167, 0.99, 1)]

In [6]:
%%sql
SELECT *
    FROM invoice
    LIMIT 10;

Done.

[(1, 18, '2017-01-03 00:00:00', '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', 15.84),
 (2, 30, '2017-01-03 00:00:00', '230 Elgin Street', 'Ottawa', 'ON', 'Canada', 'K2P 1L7', 9.9),
 (3, 40, '2017-01-05 00:00:00', '8, Rue Hanovre', 'Paris', 'None', 'France', '75002', 1.98),
 (4, 18, '2017-01-06 00:00:00', '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', 7.92),
 (5, 27, '2017-01-07 00:00:00', '1033 N Park Ave', 'Tucson', 'AZ', 'USA', '85719', 16.83),
 (6, 31, '2017-01-10 00:00:00', '194A Chain Lake Drive', 'Halifax', 'NS', 'Canada', 'B3S 1C5', 1.98),
 (7, 49, '2017-01-12 00:00:00', 'Ordynacka 10', 'Warsaw', 'None', 'Poland', '00-358', 10.89),
 (8, 59, '2017-01-13 00:00:00', '3,Raj Bhavan Road', 'Bangalore', 'None', 'India', '560001', 9.9),
 (9, 18, '2017-01-18 00:00:00', '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', 8.91),
 (10, 31, '2017-01-18 00:00:00', '194A Chain Lake Drive', 'Halifax', 'NS', 'Canada', 'B3S 1C5', 1.98)]

## Breaking it down 
Looking at the three queries above. Most invoices generally contain multiple track purchases. All unit prices are 0.99 and quantities are 1 or None. Invoice_line_id gives the total number of tracks sold  

Therefore I need to
1. Check if there is any units sold where the quantity is labelled as None. This is just to double check. 

2.Merge customer to invoice for the customer location. I could assume that billing location is country of origin. However for the purposes of this exercise I will use the country field in customer.
    - this could be done using WITH or VIEW

3.Merge the genre table with track, then track to invoice_line. The only columns I need are track_id and genre_name

4.Because each track is only purchased singularly

In [7]:
%%sql
SELECT t.track_id, g.name genre_name FROM genre g 
  LEFT JOIN track t ON g.genre_id = t.genre_id
    LIMIT 20

Done.

[(1, 'Rock'),
 (2, 'Rock'),
 (3, 'Rock'),
 (4, 'Rock'),
 (5, 'Rock'),
 (6, 'Rock'),
 (7, 'Rock'),
 (8, 'Rock'),
 (9, 'Rock'),
 (10, 'Rock'),
 (11, 'Rock'),
 (12, 'Rock'),
 (13, 'Rock'),
 (14, 'Rock'),
 (15, 'Rock'),
 (16, 'Rock'),
 (17, 'Rock'),
 (18, 'Rock'),
 (19, 'Rock'),
 (20, 'Rock')]

In [8]:
%%sql
SELECT COUNT(country)
    FROM customer

Done.

[(59,)]

In [9]:
%%sql
SELECT COUNT(billing_country)
    FROM invoice

Done.

[(614,)]

In [10]:
%%sql
WITH usa_tracks_purchased AS
    (SELECT 
     i.invoice_id invoice_id,
     il.track_id track_id, 
     i.billing_country billing_country
    FROM invoice_line il
    INNER JOIN invoice i ON il.invoice_id = i.invoice_id
    WHERE i.billing_country == 'USA'),
    genre_name AS
    (SELECT t.track_id, g.name FROM genre g 
  LEFT JOIN track t ON g.genre_id = t.genre_id)
    

SELECT COUNT(invoice_id) tracks_sold, name genre, CAST(COUNT(invoice_id) AS FLOAT)/(SELECT COUNT(invoice_id)
        FROM usa_tracks_purchased)*100 Percentage_of_tracks
    FROM usa_tracks_purchased utp
    INNER JOIN genre_name gn ON utp.track_id = gn.track_id
    GROUP BY name
    ORDER BY tracks_sold DESC

Done.

[(561, 'Rock', 53.37773549000951),
 (130, 'Alternative & Punk', 12.369172216936251),
 (124, 'Metal', 11.798287345385347),
 (53, 'R&B/Soul', 5.042816365366318),
 (36, 'Blues', 3.425309229305423),
 (35, 'Alternative', 3.3301617507136063),
 (22, 'Latin', 2.093244529019981),
 (22, 'Pop', 2.093244529019981),
 (20, 'Hip Hop/Rap', 1.9029495718363463),
 (14, 'Jazz', 1.3320647002854424),
 (13, 'Easy Listening', 1.236917221693625),
 (6, 'Reggae', 0.570884871550904),
 (5, 'Electronica/Dance', 0.47573739295908657),
 (4, 'Classical', 0.3805899143672693),
 (3, 'Heavy Metal', 0.285442435775452),
 (2, 'Soundtrack', 0.19029495718363465),
 (1, 'TV Shows', 0.09514747859181732)]

Looking at these results the recommendation would be to put the marketing money towards purchasing in order:

    1. Red Tone - Punk (which would come under Alternative& Punk)
    2. Slim Jim Bites - Blues
    3. Meteor and The Girls - Pop

## Part 2: Analysing the sales support agents

1.Find the total dollar amount of sales assigned to each sales support agent within the company. 
- Add any extra attributes for that employee that are relevant to the analysis.

- Write a short statement describing your results, and providing a possible interpretation.

Breaking this down
- looking at the table this support rep id which links top customer_id. Join at customer id. Find the total for each customer as they are each supported by one support rep. 

Then look at the employee table

In [11]:
%%sql
SELECT SUM(total), c.support_rep_id
    FROM invoice i
    INNER JOIN customer c ON i.customer_id = c.customer_id
    GROUP BY c.support_rep_id

Done.

[(1731.510000000004, 3), (1584.0000000000032, 4), (1393.9200000000028, 5)]

In [12]:

%%sql
SELECT DISTINCT support_rep_id
    FROM customer

Done.

[(3,), (4,), (5,)]

In this I was just checking whether there were any additional support_rep_id

In [13]:
%%sql
WITH support_rep_totals AS
(SELECT SUM(total) total_sales, c.support_rep_id
    FROM invoice i
    INNER JOIN customer c ON i.customer_id = c.customer_id
    GROUP BY c.support_rep_id)
    
SELECT 
    srt.support_rep_id,
    e.first_name||' '||e.last_name name,
    ROUND(srt.total_sales,2) total_sales,
    e.title,
    e.reports_to,
    e.birthdate,
    e.hire_date,
    e.country
    FROM employee e
    INNER JOIN support_rep_totals srt ON e.employee_id = srt.support_rep_id
    ORDER BY 3 DESC

Done.

[(3, 'Jane Peacock', 1731.51, 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2017-04-01 00:00:00', 'Canada'),
 (4, 'Margaret Park', 1584.0, 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2017-05-03 00:00:00', 'Canada'),
 (5, 'Steve Johnson', 1393.92, 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2017-10-17 00:00:00', 'Canada')]

## Part 3

Your next task is to analyze the sales data for customers from each different country. You have been given guidance to use the country value from the customers table, and ignore the country from the billing address in the invoice table.

In particular, you have been directed to calculate data, for each country, on the:

- total number of customers
- total value of sales
- average value of sales per customer
- average order value

Because there are a number of countries with only one customer, you should group these customers as "Other" in your analysis.

Write a query that collates data on purchases from different countries.
- Where a country has only one customer, collect them into an "Other" group.
- The results should be sorted by the total sales from highest to lowest, with the "Other" group at the very bottom.
- For each country, include:
    - total number of customers
    - total value of sales
    - average value of sales per customer
    - average order value

In [14]:
%%sql

DROP VIEW IF EXISTS country_other; 

CREATE VIEW country_other AS

    SELECT CASE
            WHEN (
                    SELECT COUNT(*)
                    FROM customer
                    WHERE country = c.country
                    GROUP BY country
                  ) = 1 THEN 'Other'
            ELSE c.country
            END AS Country,
            i.*
    FROM customer c
    INNER JOIN invoice i
    ON c.customer_id = i.customer_id;

Done.
Done.

[]

In [15]:
%%sql

SELECT
    country,
    COUNT(DISTINCT customer_id)'Number of customers',
    ROUND(SUM(total),2) total_sales,
    ROUND(SUM(total)/COUNT(customer_id),2) average_value_per_customer,
    ROUND(COUNT(DISTINCT invoice_id)/SUM(total),2) average_order_value
    FROM 
        (SELECT
         co.*,
         CASE 
             WHEN co.Country = 'Other' THEN 1
         ELSE 0
         END AS sort
         FROM country_other co)
    GROUP BY country
    ORDER BY sort, 2 DESC

Done.

[('USA', 13, 1040.49, 7.94, 0.13),
 ('Canada', 8, 535.59, 7.05, 0.14),
 ('Brazil', 5, 427.68, 7.01, 0.14),
 ('France', 5, 389.07, 7.78, 0.13),
 ('Germany', 4, 334.62, 8.16, 0.12),
 ('United Kingdom', 3, 245.52, 8.77, 0.11),
 ('Czech Republic', 2, 273.24, 9.11, 0.11),
 ('India', 2, 183.15, 8.72, 0.11),
 ('Portugal', 2, 185.13, 6.38, 0.16),
 ('Other', 15, 1094.94, 7.45, 0.13)]

## Part 4
Write a query that categorizes each invoice as either an album purchase or not, and calculates the following summary statistics:

- Number of invoices
- Percentage of invoices

Write one to two sentences explaining your findings, and making a prospective recommendation on whether the Chinook store should continue to buy full albums from record companies

In [32]:
%%sql

WITH tracks_per_album AS
    (
    SELECT
        DISTINCT album_id,
        COUNT(track_id) track_count
        FROM track t
        GROUP BY 1
    ),
    tracks_per_invoice AS
    (
        SELECT il.invoice_id, 
               t.album_id,
               COUNT(il.track_id) track_count
        FROM track t
        INNER JOIN invoice_line il
        ON il.track_id = t.track_id
        GROUP BY invoice_id, album_id
    ),
    purchase_type AS
    (SELECT il.invoice_id,il.track_id,
        CASE WHEN
                tpi.track_count = tpa.track_count THEN 'Album'
                ELSE 'Individual Tracks'
                END AS purchase_type
    FROM invoice_line AS il
    INNER JOIN tracks_per_invoice tpi ON tpi.invoice_id = il.invoice_id
    INNER JOIN tracks_per_album AS tpa ON tpa.album_id = tpi.album_id
    INNER JOIN invoice AS i ON i.invoice_id = il.invoice_id
    GROUP BY 1
    ),
    purchase_percentage AS
    (SELECT COUNT(purchase_type) total)
    

SELECT purchase_type, COUNT(*) 'tracks sold', ROUND(CAST(COUNT(DISTINCT pt.invoice_id) AS FLOAT) / (
                                                       SELECT COUNT(*) 
                                                       FROM invoice
                                                             ) * 100, 2) || "%"percentage
    FROM purchase_type pt
    GROUP BY 1

Done.

[('Album', 184, '29.97%'), ('Individual Tracks', 430, '70.03%')]

Looking at these stats there is still a sunstantial amount of sales that are derived from album sales. Therefore Chinook should buy albums from record companies. However this doesn't account for the cost of purchasing the albums or how many albums go unpurchased. Therefore it is only one layer. Further exploration is necessary.